; domain
(define (domain crash-d)
    (:requirements :strips :typing :negative-preconditions :conditional-effects)

    (:types
        car xPos yPos direction - object
    )

    (:constants
        agent - car
        left straight right - direction
    )

    (:predicates
        (equal ?C1 - car ?C2 - car)
        (hasPos ?C - car ?X1 - xPos ?Y1 - yPos)
        (hasDir ?C - car ?D - direction)
        (nextX ?D - direction ?X1 - xPos ?X2 - xPos)
        (nextY ?Y1 - yPos ?Y2 - yPos)
        (hasCrashed ?C1 - car)
        (hasBumped ?C1 - car)
        (updated)
    )

    (:action setDir
        :parameters (?D1 - direction)
        :precondition (updated)
        :effect (and
            (not (hasDir agent left))
            (not (hasDir agent straight))
            (not (hasDir agent right))
            (hasDir agent ?D1))
    )

    (:action setStop
        :parameters ()
        :precondition (updated)
        :effect (and
            (not (hasDir agent left))
            (not (hasDir agent straight))
            (not (hasDir agent right)))
    )

    (:action update
        :parameters ()
        :precondition (not (updated))
        :effect (and
            (updated)
            (forall
                (?C1 - car ?C2 - car ?Y1 - yPos ?X1 - xPos)
                (when
                    (and
                        (not (equal ?C1 ?C2))
                        (not (equal ?C1 agent))
                        (not (equal ?C2 agent))
                        (not (hasCrashed ?C1))
                        (hasPos ?C1 ?X1 ?Y1)
                        (hasPos ?C2 ?X1 ?Y1))
                    (and
                        (hasCrashed ?C1)
                        (hasCrashed ?C2)
                    )))
            (forall
                (?C1 - car ?Y1 - yPos ?X1 - xPos)
                (when
                    (and
                        (not (equal ?C1 agent))
                        (hasPos agent ?X1 ?Y1)
                        (hasPos ?C1 ?X1 ?Y1))
                    (and
                        (hasBumped agent)
                        (hasBumped ?C1)
                        (not (hasDir ?C1 left))
                        (not (hasDir ?C1 straight))
                        (not (hasDir ?C1 right))
                    ))))
    )

    (:action go
        :parameters ()
        :precondition (updated)
        :effect (and
            (not (updated))
            (forall
                (?C1 - car ?D1 - direction ?Y1 - yPos ?Y2 - yPos ?X1 - xPos ?X2 - xPos)
                (when
                    (and
                        (not (hasCrashed ?C1))
                        (hasPos ?C1 ?X1 ?Y1)
                        (hasDir ?C1 ?D1)
                        (nextX ?D1 ?X1 ?X2)
                        (nextY ?Y1 ?Y2))
                    (and
                        (not (hasPos ?C1 ?X1 ?Y1))
                        (hasPos ?C1 ?X2 ?Y2))))
        )
    )
)

; problem
(define (problem crash-p-01)
    (:domain crash-d)
    (:objects
        c1 c2 - car
        x1 x2 - xPos
        y1 y2 y3 y4 - yPos
    )
    (:init
        (updated)

        (equal agent agent)
        (equal c1 c1)
        (equal c2 c2)

        (hasPos agent x1 y1)
        (hasPos c1 x2 y1)
        (hasPos c2 x2 y3)

        (hasDir agent straight)
        (hasDir c1 straight)
        ; (hasDir c2 straight)

        (nextX straight x1 x1)
        (nextX straight x2 x2)
        (nextX right x1 x2)
        (nextX right x2 x2)
        (nextX left x1 x1)
        (nextX left x2 x1)

        (nextY y1 y2)
        (nextY y2 y3)
        (nextY y3 y4)
        (nextY y4 y4)
    )

    (:goal
        (and (updated) (hasPos agent x2 y4) (not (hasCrashed agent)))
    )
)

; plan
1. (go)
   deleted: (updated) (haspos agent x1 y1) (haspos c1 x2 y1)
   added: (haspos agent x1 y2) (haspos c1 x2 y2)
   goals met: 1 of 3
2. (update)
   added: (updated)
   goals met: 2 of 3
3. (go)
   deleted: (updated) (haspos agent x1 y2) (haspos c1 x2 y2)
   added: (haspos agent x1 y3) (haspos c1 x2 y3)
   goals met: 1 of 3
4. (update)
   added: (updated) (hascrashed c1) (hascrashed c2)
   goals met: 2 of 3
5. (setdir right)
   deleted: (hasdir agent straight)
   added: (hasdir agent right)
   goals met: 2 of 3
6. (go)
   deleted: (updated) (haspos agent x1 y3)
   added: (haspos agent x2 y4)
   goals met: 2 of 3
7. (update)
   added: (updated)
   goals met: 3 of 3
